{
  "irVersion": "1.0",
  "project": "prism",
  "repository": "https://github.com/grokify/prism",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.8.0",
      "date": "2026-06-07",
      "highlights": [
        { "description": "Unified CLI integrating all PRISM ecosystem modules" },
        { "description": "Static site generator for capability maturity dashboards" },
        { "description": "Lit web components for interactive maturity visualization" },
        { "description": "Module renames: prism-intelligence → prism-maturity, prism-execution → prism-roadmap" }
      ],
      "added": [
        { "description": "CLI with ecosystem, validate, and stats commands", "commit": "19ba787" },
        { "description": "Integrated CLI commands from prism-capability, prism-maturity, prism-roadmap", "commit": "bae9d1d" },
        { "description": "`prism site generate` command for static site generation", "commit": "a1bd139" },
        { "description": "sitegen/ package for HTML dashboard generation with maturity overlays", "commit": "c258565" },
        { "description": "Layer-based aggregation with min/avg methods", "commit": "c258565" },
        { "description": "Metrics count badge on capability cards", "commit": "c258565" },
        { "description": "@prism/ui TypeScript package with Lit web components", "commit": "60c306e" },
        { "description": "maturity-grid Lit component with by-layer and by-category views", "commit": "60c306e" },
        { "description": "LitGridData types in sitegen for JSON data generation", "commit": "5660150" },
        { "description": "`--prism-ui-js` flag for Lit component bundle integration", "commit": "5660150" },
        { "description": "Theme sync between site and Lit components (light/dark mode)", "commit": "5660150" }
      ],
      "changed": [
        { "description": "Rename ecosystem types: IntelligenceConfig → MaturityConfig, ExecutionConfig → RoadmapConfig", "commit": "9c24fb8" },
        { "description": "Rename site/ package to sitegen/ to avoid MkDocs output conflict", "commit": "749b42d" },
        { "description": "Conditional Lit vs Go template rendering based on --prism-ui-js flag", "commit": "5660150" }
      ],
      "dependencies": [
        { "description": "Update prism-maturity v0.10.0 → v0.11.0", "commit": "bd08d70" },
        { "description": "Update prism-roadmap v0.13.0 → v0.14.0", "commit": "bd08d70" },
        { "description": "Update prism-capability v0.4.0 → v0.5.0", "commit": "bd08d70" },
        { "description": "Update prism-core v0.1.0 → v0.2.0", "commit": "bd08d70" },
        { "description": "Update structured-evaluation v0.5.0 → v0.7.0", "commit": "bd08d70" },
        { "description": "Add priority-frameworks v0.2.0", "commit": "bd08d70" },
        { "description": "Add github.com/spf13/cobra v1.10.2 for CLI", "commit": "19ba787" }
      ],
      "documentation": [
        { "description": "Add docs/getting-started/ with installation and quickstart guides", "commit": "ffdac81" },
        { "description": "Add docs/cli/ with capability, maturity, roadmap, ecosystem, and site command reference", "commit": "ffdac81" },
        { "description": "Add docs/guide/ with configuration and integration guides", "commit": "ffdac81" },
        { "description": "Update README with module renames and site generator features", "commit": "64aba64" },
        { "description": "Update ECOSYSTEM.md with MaturityConfig and RoadmapConfig types", "commit": "ffdac81" }
      ]
    },
    {
      "version": "v0.7.0",
      "date": "2026-05-18",
      "highlights": [
        { "description": "Repository repurposed as PRISM ecosystem orchestrator" },
        { "description": "prism-intelligence (maturity modeling) moved to separate repository" },
        { "description": "Unified orchestration layer connecting prism-capability, prism-intelligence, and prism-execution" }
      ],
      "breaking": [
        { "description": "Previous prism functionality (maturity modeling) moved to github.com/grokify/prism-intelligence", "commit": "d93378f" },
        { "description": "This repository now serves as the ecosystem orchestrator, not the maturity library", "commit": "d93378f" }
      ],
      "added": [
        { "description": "Ecosystem package with unified orchestration types", "commit": "d93378f" },
        { "description": "Config type for loading ecosystem configuration", "commit": "d93378f" },
        { "description": "Ecosystem type aggregating CapabilityStacks, PRISMDocuments, OKRSets, and Roadmaps", "commit": "f44e15b" },
        { "description": "Cross-module queries: GetCapabilityContext, AllMetrics, AllInitiatives", "commit": "f44e15b" },
        { "description": "Cross-module validation for capability → SLI references", "commit": "f44e15b" },
        { "description": "Statistics aggregation across all modules", "commit": "f44e15b" },
        { "description": "Ecosystem tests validating integration", "commit": "31b8179" }
      ],
      "dependencies": [
        { "description": "Add github.com/grokify/prism-core v0.1.0", "commit": "f71dd5c" },
        { "description": "Add github.com/grokify/prism-capability v0.3.0", "commit": "f71dd5c" },
        { "description": "Add github.com/grokify/prism-intelligence v0.9.0", "commit": "f71dd5c" },
        { "description": "Add github.com/grokify/prism-execution v0.12.0", "commit": "f71dd5c" }
      ],
      "documentation": [
        { "description": "README with ecosystem architecture and quick start guide" },
        { "description": "ECOSYSTEM.md with full design documentation" }
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2026-05-10",
      "note": "Final release before repository restructuring. This functionality is now in github.com/grokify/prism-intelligence."
    }
  ]
}
